vacuityv/esp8266-ai/firmware/src/main.cpp
void drawCodexSprite(int frameIdx) {
  drawSpriteFrame(codexCustom, CODEX_SPRITE_FILE, codex_sprite_frames, frameIdx, CODEX_SPRITE_W, CODEX_SPRITE_H,
                  CODEX_FRAME_BYTES);
}

String pctText(float pct) {
  return pct >= 0 ? String((int)pct) + "%" : "-";
}

// "3h" / "45m" / "2h10m" reset countdown; "" when unknown.
String resetLabel(int m) {
  if (m < 0) return "";
  if (m >= 60) { int mm = m % 60; return String(m / 60) + "h" + (mm > 0 ? String(mm) + "m" : ""); }
  return String(m) + "m";
}

// Linear-interpolate two RGB565 colors (t in 0..1).
uint16_t lerp565(uint16_t a, uint16_t b, float t) {
  int ar = (a >> 11) & 0x1F, ag = (a >> 5) & 0x3F, ab = a & 0x1F;
  int br = (b >> 11) & 0x1F, bg = (b >> 5) & 0x3F, bb = b & 0x1F;
  int r = ar + (int)((br - ar) * t);
  int g = ag + (int)((bg - ag) * t);
  int bl = ab + (int)((bb - ab) * t);
  return (uint16_t)((r << 11) | (g << 5) | bl);
}

// One progress bar: dark track, purple->green gradient fill of length `fillPct`,
// plus an optional time marker (light core, dark edges) at `timePct`.
void drawQuotaBar(int x, int y, int w, int h, float fillPct, float timePct, bool hasTime) {
  tft.fillRoundRect(x, y, w, h, h / 2, tft.color565(48, 48, 48));
  uint16_t pur = tft.color565(125, 92, 252), grn = tft.color565(61, 214, 140);
  int fillW = (int)(w * constrain(fillPct, 0.0f, 100.0f) / 100.0f);
  for (int i = 0; i < fillW; i++) {
    tft.drawFastVLine(x + i, y, h, lerp565(pur, grn, (float)i / w));
  }
  if (hasTime) {
    int ax = x + (int)(w * constrain(timePct, 0.0f, 100.0f) / 100.0f);
    tft.fillRect(ax - 2, y, 4, h, tft.color565(8, 8, 8)); // dark edge
    tft.fillRect(ax - 1, y, 2, h, TFT_WHITE);             // light core
  }
}

// App logo in the top-left corner (inside the quota ring) so a glance tells
// which app the screen is currently showing. Drawn row-by-row from PROGMEM
// through rowBuf, same as the sprite path.
const int LOGO_X = 14, LOGO_Y = 18;

void drawAppLogo() {
  const uint16_t *logo = (currentApp == APP_CLAUDE) ? claude_logo_0 : codex_logo_0;
  int w = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_W : CODEX_LOGO_W;
  int h = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_H : CODEX_LOGO_H;
  for (int r = 0; r < h; r++) {
    memcpy_P(rowBuf, logo + (size_t)r * w, (size_t)w * 2);
    tft.pushImage(LOGO_X, LOGO_Y + r, w, 1, rowBuf);
  }
}

// Claude's ring percentage: real 5h OAuth quota from the bridge when known,
// otherwise fall back to elapsed session time as a rough stand-in.
float claudeRingPct() {
  if (claudeStatus.fiveHourPct >= 0) return claudeStatus.fiveHourPct;
  return claudeStatus.sessionWindowMin > 0
             ? (100.0 * claudeStatus.sessionMin / claudeStatus.sessionWindowMin)
             : 0;
}

// Bottom quota panel: "5h 27%" + reset countdown, a 5h usage bar with a time
// marker, and a thinner weekly bar with its own marker (fill = used %, the line
// = elapsed time in that window).
void drawQuotaBars() {
  // No black clear here: the bars overwrite themselves (the track fills the whole
  // bar) and the labels are space-padded to erase old chars, so refreshing this
  // panel each poll doesn't blank anything and there's no flicker.
  float fivePct, weekPct, fiveTime = 0, weekTime = 0;
  bool fiveHasTime = false, weekHasTime = false;
  int fiveResetMin;
  if (currentApp == APP_CLAUDE) {
    fivePct = claudeRingPct();
    weekPct = max(claudeStatus.sevenDayPct, 0.0f);
    if (claudeStatus.fiveHourResetMin >= 0) {
      fiveTime = 100.0f * (300 - claudeStatus.fiveHourResetMin) / 300.0f; fiveHasTime = true;
    } else if (claudeStatus.sessionWindowMin > 0) {
      fiveTime = 100.0f * claudeStatus.sessionMin / claudeStatus.sessionWindowMin; fiveHasTime = true;
    }
    if (claudeStatus.sevenDayResetMin >= 0) {
      weekTime = 100.0f * (10080 - claudeStatus.sevenDayResetMin) / 10080.0f; weekHasTime = true;
    }
    fiveResetMin = claudeStatus.fiveHourResetMin;
  } else {
    fivePct = max(codexStatus.primaryPct, 0.0f);
    weekPct = max(codexStatus.weeklyPct, 0.0f);
    if (codexStatus.primaryResetMin >= 0 && codexStatus.primaryWindowMin > 0) {
      fiveTime = 100.0f * (codexStatus.primaryWindowMin - codexStatus.primaryResetMin) / codexStatus.primaryWindowMin;
      fiveHasTime = true;
    }
    if (codexStatus.weeklyResetMin >= 0 && codexStatus.weeklyWindowMin > 0) {
      weekTime = 100.0f * (codexStatus.weeklyWindowMin - codexStatus.weeklyResetMin) / codexStatus.weeklyWindowMin;
      weekHasTime = true;
    }
    fiveResetMin = codexStatus.primaryResetMin;
  }
  String lbl = pctText(fivePct);
  while (lbl.length() < 4) lbl += ' ';   // trailing pad erases a longer old value
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.drawString(lbl, 20, 178, 2);
  String rl = resetLabel(fiveResetMin);
  while (rl.length() < 6) rl = ' ' + rl; // leading pad for the right-aligned text
  tft.setTextColor(tft.color565(160, 160, 160), TFT_BLACK);
  tft.setTextDatum(TR_DATUM);
  tft.drawString(rl, 220, 178, 2);
  drawQuotaBar(20, 196, 200, 9, fivePct, fiveTime, fiveHasTime);
  drawQuotaBar(20, 217, 200, 6, weekPct, weekTime, weekHasTime);
}

// Redraws whichever app is currently active, full screen: sprite + quota bars.
void drawActiveApp() {
  tft.fillScreen(TFT_BLACK);
  if (currentApp == APP_CLAUDE) drawClaudeSprite(claudeFrame);
  else drawCodexSprite(codexFrame);
  drawQuotaBars();
  drawAppLogo();
}

// Who gets the screen:
//   - display mode pinned (Mac app) -> that app, always
//   - exactly one app working       -> that app, immediately
//   - both working                  -> alternate every SWITCH_BOTH_MS (2s)
//   - neither working               -> alternate slowly (SWITCH_IDLE_MS)
bool updateActiveApp() {
  ActiveApp desired = currentApp;

  if (displayMode == MODE_CLAUDE) {
    desired = APP_CLAUDE;
  } else if (displayMode == MODE_CODEX) {
    desired = APP_CODEX;
  } else if (claudeStatus.needsInput && !codexStatus.needsInput) {
    desired = APP_CLAUDE; // approval prompt wins the screen
  } else if (codexStatus.needsInput && !claudeStatus.needsInput) {
    desired = APP_CODEX;
  } else {
    bool claudeWorking = claudeStatus.status == "working";
    bool codexWorking = codexStatus.status == "working";
    // Only treat Codex as a real app to show if it's actually in use; otherwise
    // AUTO would keep flipping to a Codex screen the user never set up.
    bool codexActive = codexStatus.status != "offline" && codexStatus.status != "unknown";
    if (claudeWorking && !codexWorking) {
      desired = APP_CLAUDE;
    } else if (codexWorking && !claudeWorking) {
      desired = APP_CODEX;
    } else if (!codexActive) {
      desired = APP_CLAUDE; // Codex not in use -> just stay on Claude, no flipping
    } else {
      unsigned long interval = (claudeWorking && codexWorking) ? SWITCH_BOTH_MS : SWITCH_IDLE_MS;
      if (millis() - lastSwitchMs >= interval) {
        lastSwitchMs = millis();
        desired = (currentApp == APP_CLAUDE) ? APP_CODEX : APP_CLAUDE;
      }
    }
  }

