vacuityv/esp8266-ai/firmware/src/main.cpp
// ---------- relay control channel (v2) ----------
// When the clock and the Mac are on different LANs the Mac can't reach us
// directly, so control flows through the relay: we report /api/info to it and
// poll it for queued commands. All requests just append paths to bridgeHost
// (which already carries the /r/<secret> capability prefix), exactly like the
// telemetry polls. NOTE: written but not yet verified on hardware.
const unsigned long INFO_REPORT_INTERVAL_MS = 10000; // push our state to the relay
const unsigned long CMD_POLL_INTERVAL_MS = 3000;     // pull queued commands
unsigned long lastInfoReportMs = 0;
unsigned long lastCmdPollMs = 0;
int lastReportedSpriteRev = -1; // re-upload sprite raw to the relay when this changes

// POST our /api/info JSON to the relay so the Mac can read it cross-LAN.
void reportDeviceInfo() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/deviceinfo";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  http.addHeader("Content-Type", "application/json");
  http.POST(buildDeviceInfoJson());
  http.end();
}

// Fetch the gif the Mac uploaded to the relay for `slot`, write it to the slot's
// gif file, then decode+apply it (same final path as a multipart upload).
bool applySpriteFromRelay(ActiveApp slot) {
  const char *gifPath = (slot == APP_CLAUDE) ? CLAUDE_GIF_FILE : CODEX_GIF_FILE;
  const char *slotName = (slot == APP_CLAUDE) ? "claude" : "codex";
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/gif/" + slotName + "?id=" + deviceId;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) { http.end(); return false; }
  File f = LittleFS.open(gifPath, "w");
  if (!f) { http.end(); return false; }
  http.writeToStream(&f);
  f.close();
  http.end();
  return applyDecodedGif(slot);
}

// Synthesize a built-in slot's sprite raw ([count][RGB565 frames]) into `path`.
// PROGMEM frames are copied through a small RAM buffer (flash can't be memcpy'd
// directly). Custom sprites don't need this — their .bin file already IS the raw.
bool writeBuiltinSpriteRaw(ActiveApp slot, const char *path) {
  int frames = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_FRAMES : CODEX_SPRITE_FRAMES;
  int w = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
  int h = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
  const uint16_t *const *arr = (slot == APP_CLAUDE) ? claude_sprite_frames : codex_sprite_frames;
  size_t frameBytes = (size_t)w * h * 2;
  File f = LittleFS.open(path, "w");
  if (!f) return false;
  uint8_t cnt = (uint8_t)frames;
  f.write(cnt);
  uint8_t buf[256];
  for (int i = 0; i < frames; i++) {
    const uint8_t *src = (const uint8_t *)arr[i];
    size_t off = 0;
    while (off < frameBytes) {
      size_t n = frameBytes - off;
      if (n > sizeof(buf)) n = sizeof(buf);
      memcpy_P(buf, src + off, n);
      f.write(buf, n);
      off += n;
      yield();
    }
  }
  f.close();
  return true;
}

// POST a slot's current sprite raw to the relay so the Mac mirror can show the
// exact animation on screen even cross-LAN.
void reportSprite(ActiveApp slot) {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  bool custom = (slot == APP_CLAUDE) ? claudeCustom : codexCustom;
  const char *slotName = (slot == APP_CLAUDE) ? "claude" : "codex";
  const char *binPath = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
  const char *tmpPath = "/sprite_up.tmp";
  const char *srcPath;
  if (custom && LittleFS.exists(binPath)) {
    srcPath = binPath; // custom .bin is already the wire raw
  } else {
    if (!writeBuiltinSpriteRaw(slot, tmpPath)) return;
    srcPath = tmpPath;
  }
  File f = LittleFS.open(srcPath, "r");
  if (f) {
    WiFiClient client;
    HTTPClient http;
    String url = "http://" + bridgeHost + "/sprite/" + slotName + "?id=" + deviceId;
    http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
    if (http.begin(client, url)) {
      http.addHeader("Content-Type", "application/octet-stream");
      http.sendRequest("POST", &f, f.size());
      http.end();
    }
    f.close();
  }
  if (srcPath == tmpPath) LittleFS.remove(tmpPath);
}

// Pull queued commands from the relay and apply each locally. The relay returns
// a JSON array and clears the queue on read.
void pollCommands() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/commands?id=" + deviceId;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code != HTTP_CODE_OK) { http.end(); return; }
  String payload = http.getString();
  http.end();

  JsonDocument doc;
  if (deserializeJson(doc, payload)) return; // parse error -> ignore
  JsonArray cmds = doc.as<JsonArray>();
  if (cmds.size() == 0) return;
  for (JsonObject cmd : cmds) {
    const char *type = cmd["type"] | "";
    if (strcmp(type, "display") == 0) {
      String mode = cmd["mode"] | "auto";
      applyDisplayMode(mode);
    } else if (strcmp(type, "reset") == 0) {
      const char *slot = cmd["slot"] | "";
      resetSpriteSlot(strcmp(slot, "codex") == 0 ? APP_CODEX : APP_CLAUDE);
    } else if (strcmp(type, "sprite") == 0) {
      const char *slot = cmd["slot"] | "";
      applySpriteFromRelay(strcmp(slot, "codex") == 0 ? APP_CODEX : APP_CLAUDE);
    } else if (strcmp(type, "bridge") == 0) {
      const char *host = cmd["host"] | "";
      if (strlen(host) > 0) { bridgeHost = host; saveBridgeHost(bridgeHost); }
    }
  }
  // Report right after applying so the Mac sees the new state fast instead of
  // waiting for the next periodic report.
  reportDeviceInfo();
  lastInfoReportMs = millis();
}

void setupWebServer() {
  webServer.on("/", HTTP_GET, handleRoot);
  webServer.on("/save", HTTP_POST, handleSave);
  webServer.on("/reset-wifi", HTTP_POST, handleResetWifi);
  webServer.on("/api/info", HTTP_GET, handleApiInfo);
  webServer.on("/api/display", HTTP_POST, handleApiDisplay);
  webServer.on("/api/bridge", HTTP_POST, handleApiBridge);
  webServer.on("/sprite/claude/reset", HTTP_POST, []() { handleSpriteReset(APP_CLAUDE); });
  webServer.on("/sprite/codex/reset", HTTP_POST, []() { handleSpriteReset(APP_CODEX); });
  webServer.on("/sprite/claude/raw", HTTP_GET, []() { handleSpriteRaw(APP_CLAUDE); });
  webServer.on("/sprite/codex/raw", HTTP_GET, []() { handleSpriteRaw(APP_CODEX); });
  webServer.on(
      "/sprite/claude", HTTP_POST, []() { handleSpriteUploadDone(APP_CLAUDE); },
      []() { handleSpriteUploadChunk(CLAUDE_GIF_FILE); });
  webServer.on(
      "/sprite/codex", HTTP_POST, []() { handleSpriteUploadDone(APP_CODEX); },
      []() { handleSpriteUploadChunk(CODEX_GIF_FILE); });
  webServer.begin();
  Serial.printf("[web] admin server listening on http://%s/\n", WiFi.localIP().toString().c_str());
}

// ---------- Arduino entry points ----------

void setup() {
  Serial.begin(115200);
  LittleFS.begin();
  loadBridgeHost();
  loadSchedule();
  loadDisplayMode();
  loadDeviceName();
  deviceId = String(ESP.getChipId(), HEX);
  loadCustomSpriteState();

  tft.init();
  tft.setRotation(0);
  tft.fillScreen(TFT_BLACK);

  setupWiFi();
  setupWebServer();
  // Advertise http://aiclock.local so the admin page is reachable by name
  // (no IP hunting). macOS/iOS resolve .local natively via Bonjour.
  if (MDNS.begin("aiclock")) MDNS.addService("http", "tcp", 80);
  // NTP for the screen-off schedule (China UTC+8, no DST).
  configTime(8 * 3600, 0, "ntp.aliyun.com", "ntp.tencent.com", "cn.pool.ntp.org");

