vacuityv/esp8266-ai/firmware/src/main.cpp
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("WiFi connected", 8, 66, 2);
  tft.drawString("Admin page:", 8, 94, 2);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString("aiclock.local", 8, 116, 2);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("or " + WiFi.localIP().toString(), 8, 140, 2);
  delay(3000);

  drawStaticChrome();
  drawActiveApp();
  pollBridge();
}

void loop() {
  webServer.handleClient();
  MDNS.update();
  unsigned long nowMs = millis();

  // Screen-off schedule: turn the backlight off inside the configured window.
  if (nowMs - lastScheduleMs >= 10000) {
    lastScheduleMs = nowMs;
    setBacklight(!inOffWindow());
  }

  // Effective mode may differ from the configured one (AUTO -> music while
  // audio plays). On a transition, reset the incoming mode's chrome so it
  // repaints cleanly, and repaint the pet immediately when returning to it.
  DisplayMode eff = effectiveMode();
  if (eff != lastEffectiveMode) {
    lastEffectiveMode = eff;
    if (eff == MODE_NET) {
      netChromeDrawn = false;
      lastNetPollMs = 0;
    } else if (eff == MODE_MUSIC) {
      musicChromeDrawn = false;
      lastMusicPollMs = 0;
    } else {
      updateActiveApp();
      drawActiveApp();
    }
  }

  if (eff == MODE_NET) {
    // net-speed mode: rendering (constant-rate sweep) is independent of the
    // bridge polls that refill its sample queue
    if (nowMs - lastNetDrawMs >= NET_DRAW_INTERVAL_MS) {
      lastNetDrawMs = nowMs;
      netDrawTick();
    }
    if (nowMs - lastNetPollMs >= NET_POLL_INTERVAL_MS) {
      lastNetPollMs = nowMs;
      pollNet();
    }
  } else if (eff == MODE_MUSIC) {
    // music now-playing mode: cover art + track metadata from the bridge
    if (nowMs - lastMusicPollMs >= MUSIC_POLL_INTERVAL_MS) {
      lastMusicPollMs = nowMs;
      pollMusic();
    }
  } else {
    // sprite walk-cycle animation (only advances while that app is showing)
    if (nowMs - lastAnimMs >= ANIM_INTERVAL_MS) {
      lastAnimMs = nowMs;
      bool claudeWorking = claudeStatus.status == "working";
      bool codexWorking = codexStatus.status == "working";
      if (currentApp == APP_CLAUDE && claudeWorking) {
        claudeFrame = (claudeFrame + 1) % claudeFrameCount();
        drawClaudeSprite(claudeFrame);
      } else if (currentApp == APP_CODEX && codexWorking) {
        codexFrame = (codexFrame + 1) % codexFrameCount();
        drawCodexSprite(codexFrame);
      }
    }

    // "urgent" flash toggle (independent, faster cadence)
    if (nowMs - lastFlashMs >= FLASH_INTERVAL_MS) {
      lastFlashMs = nowMs;
      flashOn = !flashOn;
      // stale data or approval-needed: flash a red edge border for attention.
      // When the condition clears, clear the border once (otherwise the last
      // red frame stays stuck since nothing repaints the edge in fixed mode).
      if (bridgeStale() || currentAppNeedsInput()) {
        drawFullBorder(flashOn ? TFT_RED : TFT_BLACK);
        borderShown = true;
      } else if (borderShown) {
        drawFullBorder(TFT_BLACK);
        borderShown = false;
      }
    }

    // alternate which app is shown when neither/both are uniquely working
    if (updateActiveApp()) {
      drawActiveApp();
    }
  }

  // status poll continues in every mode (feeds /api/info and the web page)
  if (nowMs - lastPollMs >= BRIDGE_POLL_INTERVAL_MS) {
    lastPollMs = nowMs;
    pollBridge();
  }

  // Relay control channel (v2): report our state + pull queued commands.
  if (nowMs - lastInfoReportMs >= INFO_REPORT_INTERVAL_MS) {
    lastInfoReportMs = nowMs;
    reportDeviceInfo();
  }
  if (nowMs - lastCmdPollMs >= CMD_POLL_INTERVAL_MS) {
    lastCmdPollMs = nowMs;
    pollCommands();
  }
  // Re-upload sprite raw to the relay when it changes (and once after connect),
  // so the Mac mirror can show the on-screen animation cross-LAN.
  if (WiFi.status() == WL_CONNECTED && bridgeHost.length() > 0 &&
      spriteRev != lastReportedSpriteRev) {
    lastReportedSpriteRev = spriteRev;
    reportSprite(APP_CLAUDE);
    reportSprite(APP_CODEX);
  }
}
